// ============================================================================
// 
// ちょちょいと自動更新 2 共通で使用する定数
// 
// ============================================================================

// ----------------------------------------------------------------------------
//
// ----------------------------------------------------------------------------

using System;

namespace Updater.Models.SharedMisc
{
	public class UpdConstants
	{
		// ====================================================================
		// public 定数
		// ====================================================================

		// --------------------------------------------------------------------
		// アプリの基本情報
		// --------------------------------------------------------------------
		public const String APP_ID = "Updater2";
		public const String APP_NAME_J = "ちょちょいと自動更新 2";
		public const String APP_VER = "Ver 1.01";
		public const String COPYRIGHT_J = "Copyright (C) 2021 by SHINTA";

		// --------------------------------------------------------------------
		// MessageKey
		// --------------------------------------------------------------------

		// ウィンドウを閉じる
		public const String MESSAGE_KEY_WINDOW_CLOSE = "Close";

		// バージョン情報ウィンドウを開く
		public const String MESSAGE_KEY_OPEN_ABOUT_WINDOW = "OpenAboutWindow";

		// 更新適用可否確認ウィンドウを開く
		public const String MESSAGE_KEY_OPEN_ASK_UPDATE_WINDOW = "OpenAskUpdateWindow";

		// --------------------------------------------------------------------
		// URL
		// --------------------------------------------------------------------

		// Fantia
		public const String URL_FANTIA = "https://fantia.jp/fanclubs/65509";

		// --------------------------------------------------------------------
		// その他
		// --------------------------------------------------------------------

		// メインウィンドウの横幅
		public const Double MAIN_WINDOW_WIDTH = 635.0;

		// メインウィンドウの左端
		public const Double MAIN_WINDOW_LEFT = 20.0;
	}
}
