// ============================================================================
// 
// ちょちょいと自動更新 2 全体で使う関数
// 
// ============================================================================

// ----------------------------------------------------------------------------
// 
// ----------------------------------------------------------------------------

using Shinta;

using System;

namespace Updater.Models.SharedMisc
{
	public class UpdCommon
	{
		// ====================================================================
		// public static メンバー関数
		// ====================================================================

		// --------------------------------------------------------------------
		// 通知対象ウィンドウに、UI を表示したことを通知（1 度だけ）
		// --------------------------------------------------------------------
		public static void NotifyDisplayedIfNeeded(UpdaterLauncher launchParams)
		{
			if (_notified || launchParams.NotifyHWnd == IntPtr.Zero)
			{
				return;
			}

			// 通知
			_notified = true;
			WindowsApi.PostMessage(launchParams.NotifyHWnd, UpdaterLauncher.WM_UPDATER_UI_DISPLAYED, IntPtr.Zero, IntPtr.Zero);
		}

		// ====================================================================
		// private static メンバー変数
		// ====================================================================

		// 通知対象ウィンドウに、UI を表示したことを通知したかどうか
		private static Boolean _notified = false;
	}
}
